ДипломДубль/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ДатыОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДипломДубль/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УсловноеОформлениеТЧ(); 
КонецПроцедуры
# КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников
&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ТекДанные.ДатаНачала < НачалоГода(Объект.Год) Или ТекДанные.ДатаНачала > КонецГода(Объект.Год) Тогда    
		ТекДанные.ДатаНачала = НачалоГода(Объект.Год);
	КонецЕсли;	 
	
	Если ТекДанные.ДатаНачала > ТекДанные.ДатаОкончания И ТекДанные.ДатаОкончания <> Дата(1,1,1) Тогда    
		ТекДанные.ДатаНачала = ТекДанные.ДатаОкончания;
	КонецЕсли;	 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ТекДанные.ДатаОкончания < НачалоГода(Объект.Год) Или ТекДанные.ДатаОкончания > КонецГода(Объект.Год) Тогда    
		ТекДанные.ДатаОкончания = КонецГода(Объект.Год);
	КонецЕсли;	           
	
	Если ТекДанные.ДатаНачала > ТекДанные.ДатаОкончания И ТекДанные.ДатаОкончания <> Дата(1,1,1) Тогда    
		ТекДанные.ДатаНачала = ТекДанные.ДатаОкончания;
	КонецЕсли;	  
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)           
	УсловноеОформлениеТЧ(); 
	Элементы.ОтпускаСотрудников.Обновить();
КонецПроцедуры

# КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура АнализГрафиков(Команда)
    // 1. Подготовка данных
    ДанныеСтруктура = Новый Структура("ГрафикОтпусков", Объект.ОтпускаСотрудников);

    // 2. Помещение во временное хранилище
    Адрес = ПоместитьДанныеВХ(ДанныеСтруктура);

    // 3. Передача через параметры
    ПараметрыФормы = Новый Структура("АдресВХ", Адрес);
    ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы);
КонецПроцедуры
# КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере  
Процедура УсловноеОформлениеТЧ()     
	
	
	Сотрудники = ПроверитьОтпуска();
	
	УсловноеОформление.Элементы.Очистить();
	Если Сотрудники.Количество() > 0 Тогда

		НовыйЭлементУФ = УсловноеОформление.Элементы.Добавить();
		ОформленийЦвет = НовыйЭлементУФ.Оформление.Элементы.Найти("ЦветФона");
		ОформленийЦвет.Значение = WebЦвета.Красный;
		ОформленийЦвет.Использование = Истина;
		
		НастройкаОтбора = НовыйЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
		НастройкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		НастройкаОтбора.ПравоеЗначение = Сотрудники;
		
		ОформляемыеПоля = НовыйЭлементУФ.Поля.Элементы.Добавить();
		ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковНомерСтроки");
		ОформляемыеПоля.Использование = Истина;	
		ОформляемыеПоля = НовыйЭлементУФ.Поля.Элементы.Добавить();
		ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");
		ОформляемыеПоля.Использование = Истина;	
		ОформляемыеПоля = НовыйЭлементУФ.Поля.Элементы.Добавить();
		ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаНачала");
		ОформляемыеПоля.Использование = Истина;	
		ОформляемыеПоля = НовыйЭлементУФ.Поля.Элементы.Добавить();
		ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаОкончания");
		ОформляемыеПоля.Использование = Истина;	
		
	КонецЕсли;	
КонецПроцедуры	

&НаСервере  
Функция ПроверитьОтпуска()    
	
	СписокСотрудников = Новый СписокЗначений;         
	
	ТЗСотрудники = Новый ТаблицаЗначений;
	ТЗСотрудники.Колонки.Добавить("СотрудникТЗ", Новый ОписаниеТипов("СправочникССылка.Пользователи"));
	ТЗСотрудники.Колонки.Добавить("Дни", Новый ОписаниеТипов("Число")); 
	
	
	Для Каждого Строка из Объект.ОтпускаСотрудников Цикл  
		Стр = ТЗСотрудники.Добавить();
		Стр.СотрудникТЗ = Строка.Сотрудник;
		Стр.Дни = (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала)) / (60 * 60 * 24); 
	КонецЦикла;	
	
	ТЗСотрудники.Свернуть("СотрудникТЗ", "Дни");
	
	Для Каждого Строка Из ТЗСотрудники Цикл  
		Если Строка.Дни > 28 Тогда 
			СписокСотрудников.Добавить(Строка.СотрудникТЗ);
		КонецЕсли;	
	КонецЦикла;	
	
    Возврат СписокСотрудников;
	
КонецФункции	

&НаСервере
Функция ПоместитьДанныеВХ(Данные)
    //@skip-check form-self-reference
    Возврат ПоместитьВоВременноеХранилище(Данные, ЭтаФорма.УникальныйИдентификатор);
КонецФункции
#КонецОбласти
